Courses/4420/Lectures/SecSoftware/secsoftware-lab2-2018.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2020-10-01 Thu 00:52 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Lab: Software without Security Holes #2</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Prabhaker Mateti" />
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="../"> UP </a>
 |
 <a accesskey="H" href="../../Top/index.html"> HOME </a>
</div><div id="preamble" class="status">
<a href="../../"> ../../</a>
</div>
<div id="content">
<h1 class="title">Lab: Software without Security Holes #2</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org2be9867">1. Background</a></li>
<li><a href="#org4d0c73d">2. Tasks: [Bonus][Optional]</a>
<ul>
<li><a href="#orgbbd4056">2.1. Task: Static Analysis Tool LLVM Clang-Analyzer [20 points]</a></li>
<li><a href="#org5122057">2.2. Task: CodeChecker [20 points]</a></li>
<li><a href="#org7968f86">2.3. Task: Assert fusermount [20 points]</a></li>
<li><a href="#orgf18f748">2.4. Task: Comparative Review [20 points]</a></li>
</ul>
</li>
<li><a href="#org415ef50">3. Submission</a></li>
<li><a href="#org0fe0e92">4. References</a></li>
<li><a href="#org84cdd67">5. End</a></li>
</ul>
</div>
</div>

<div id="outline-container-org2be9867" class="outline-2">
<h2 id="org2be9867"><span class="section-number-2">1</span> Background</h2>
<div class="outline-text-2" id="text-1">
<ol class="org-ol">
<li>Objective: Introduce you to formal methods based tools.  Get you to
think about secure programming some more.</li>

<li>fusermount::
<a href="https://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2018-10906">https://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2018-10906</a>
fusermount is vulnerable to a restriction bypass when SELinux is
active. This allows non-root users to mount a FUSE file system with
the 'allow-other' mount option regardless of whether
'user-allow-other' is set in the fuse configuration. An attacker
may use this flaw to mount a FUSE file system, accessible by other
users, and trick them into accessing files on that file system,
possibly causing Denial of Service or other unspecified effects.
<a href="https://www.exploit-db.com/exploits/45106/">https://www.exploit-db.com/exploits/45106/</a> CVE-2018-10906 Reference</li>

<li>ShellShock:: Refresh your hold on <code>bash</code> syntax and usage.</li>

<li>HeartBleed:: Discovered in 2014, about the same time as shellshock.
The bug is in SSL networking.  Not part of this course.</li>

<li>Coding Guides:: For C and C++: Part of this course.  For Java: Not
part of this course.</li>

<li>System Programs: mount, fusermount, sudo, su, passwd, chsh, &#x2026;  We
expect these to be free of security holes.</li>

<li>Ordinary/ non-system programs/ utilities: cat, ls, date, make, and
even login, bash, ash, dash, csh, zsh and other shells.</li>
</ol>
</div>
</div>




<div id="outline-container-org4d0c73d" class="outline-2">
<h2 id="org4d0c73d"><span class="section-number-2">2</span> Tasks: [Bonus][Optional]</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-orgbbd4056" class="outline-3">
<h3 id="orgbbd4056"><span class="section-number-3">2.1</span> Task: Static Analysis Tool LLVM Clang-Analyzer [20 points]</h3>
<div class="outline-text-3" id="text-2-1">
<ol class="org-ol">
<li>Background: <a href="https://clang-analyzer.llvm.org/">https://clang-analyzer.llvm.org/</a> LLVM Clang-Analyzer</li>

<li>Analyze, using <code>scan-build</code>, the source code of <a href="https://github.com/libfuse/libfuse/blob/master/util/fusermount.c">fusermount.c</a>.</li>
</ol>
</div>
</div>

<div id="outline-container-org5122057" class="outline-3">
<h3 id="org5122057"><span class="section-number-3">2.2</span> Task: CodeChecker [20 points]</h3>
<div class="outline-text-3" id="text-2-2">
<ol class="org-ol">
<li><a href="https://github.com/Ericsson/codechecker">https://github.com/Ericsson/codechecker</a> CodeChecker is a static
analysis infrastructure built on the LLVM/Clang Static Analyzer
toolchain, replacing <code>scan-build</code> in a Linux or OS-X development
environment.</li>

<li>Analyze, using <code>codechecker</code>, the source code of <a href="https://github.com/libfuse/libfuse/blob/master/util/fusermount.c">fusermount.c</a>.</li>
</ol>
</div>
</div>

<div id="outline-container-org7968f86" class="outline-3">
<h3 id="org7968f86"><span class="section-number-3">2.3</span> Task: Assert fusermount [20 points]</h3>
<div class="outline-text-3" id="text-2-3">
<ol class="org-ol">
<li>Assert fusermount.c.  Give an entry assertion, an exit assertion,
and a loop invariant for ten non-trivial functions/ procedures of
<a href="https://github.com/libfuse/libfuse/blob/master/util/fusermount.c">fusermount.c</a>.</li>
</ol>
</div>
</div>

<div id="outline-container-orgf18f748" class="outline-3">
<h3 id="orgf18f748"><span class="section-number-3">2.4</span> Task: Comparative Review [20 points]</h3>
<div class="outline-text-3" id="text-2-4">
<ol class="org-ol">
<li>Write a comparative review of the tools used in this lab, and in
previous lab SecSoftware#1.  Ok to do the write up based just on
reading about the tools, but it is better if it based on experience
of having used them long enough.</li>
</ol>
</div>
</div>
</div>

<div id="outline-container-org415ef50" class="outline-2">
<h2 id="org415ef50"><span class="section-number-2">3</span> Submission</h2>
<div class="outline-text-2" id="text-3">
<ol class="org-ol">
<li>Lab Report quality: 15 points.</li>

<li>You must follow the Lab Report Template. There should be a section
on each of the tasks. A couple of lines of an answer to each
(implied/ explicit) question/ discussion item.  Must number it as
in this document.</li>

<li>Use good judgement and do not make the report way longer than, say,
20 pages. Submit explanations and code that verifies your answers.</li>

<li>[5 points] Include a journal.  By the hour.</li>

<li>Submit a PDF file named exactly <code>Report-L5.pdf</code>, and a tarball
<code>L5.tbz</code> [use <code>tar cfjvv L5.tbz source-files*</code> ]. (Scripts are used
to check various things – so file names should obey such "rules".)</li>
</ol>
</div>
</div>


<div id="outline-container-org0fe0e92" class="outline-2">
<h2 id="org0fe0e92"><span class="section-number-2">4</span> References</h2>
<div class="outline-text-2" id="text-4">
<ol class="org-ol">
<li>Prabhaker Mateti, <a href="../SecSoftware">../SecSoftware</a> 2018. Required Reading.</li>

<li>ShellShock Refs
<ol class="org-ol">
<li><a href="https://www.us-cert.gov/ncas/alerts/TA14-268A">https://www.us-cert.gov/ncas/alerts/TA14-268A</a>;</li>

<li><a href="https://www.owasp.org/images/1/1b/Shellshock_-_Tudor_Enache.pdf">https://www.owasp.org/images/1/1b/Shellshock_-_Tudor_Enache.pdf</a>
25 slides,</li>
<li><a href="https://www.cybrary.it/0p3n/shellshock-all-you-need-to-know-about-the-bash-bug-vulnerability/">https://www.cybrary.it/0p3n/shellshock-all-you-need-to-know-about-the-bash-bug-vulnerability/</a></li>
<li><a href="https://security.stackexchange.com/questions/68448/where-is-bash-shellshock-vulnerability-in-source-code">https://security.stackexchange.com/questions/68448/where-is-bash-shellshock-vulnerability-in-source-code</a></li>
</ol></li>

<li>CLang Analyzer Refs
<ol class="org-ol">
<li><a href="http://btorpey.github.io/blog/2015/04/27/static-analysis-with-clang/">http://btorpey.github.io/blog/2015/04/27/static-analysis-with-clang/</a>;;</li>
<li><a href="https://developer.mozilla.org/en-US/docs/Mozilla/Testing/Clang_static_analysis">https://developer.mozilla.org/en-US/docs/Mozilla/Testing/Clang_static_analysis</a></li>
</ol></li>
</ol>
</div>
</div>


<div id="outline-container-org84cdd67" class="outline-2">
<h2 id="org84cdd67"><span class="section-number-2">5</span> End</h2>
<div class="outline-text-2" id="text-5">
</div>
</div>
</div>
<div id="postamble" class="status">
<hr size=1>Copyright &copy; 2018 <a href="http://www.wright.edu/~pmateti">www.wright.edu/~pmateti</a> &bull; 2018-10-25
</div>
</body>
</html>
